# Ton Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Ton Property
SymbolTypeId Class See Also
---
Symbol ton, indicating unit Tons of refrigeration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Ton { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Ton As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Ton {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace